-- phpMyAdmin SQL Dump
-- version 4.0.10deb1
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Окт 15 2017 г., 17:01
-- Версия сервера: 5.5.55-0ubuntu0.14.04.1
-- Версия PHP: 5.5.9-1ubuntu4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `quiz`
--

-- --------------------------------------------------------

--
-- Структура таблицы `questions`
--

CREATE TABLE IF NOT EXISTS `questions` (
  `question_number_id` int(20) DEFAULT NULL,
  `theme` varchar(25) DEFAULT NULL,
  `question` varchar(150) DEFAULT NULL,
  `answer` varchar(20) DEFAULT NULL,
  `points` int(3) DEFAULT NULL,
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`),
  KEY `question_number_id` (`question_number_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

--
-- Дамп данных таблицы `questions`
--

INSERT INTO `questions` (`question_number_id`, `theme`, `question`, `answer`, `points`, `id`) VALUES
(1, 'литература', 'Кто написал комедию "Горе от ума"?', 'грибоедов', 10, 1),
(2, 'литература', 'Кто написал комедию "Преступление и наказание"?', 'достоевский', 10, 2),
(3, 'литература', 'В каком году родился Марк Твен', '1835', 10, 3),
(4, 'литература', 'В каком году родился Ф.М. Достоевский', '1821', 10, 4),
(5, 'литература', 'В каком году написан роман "Мастер и Маргарита"?', '1928', 10, 5),
(1, 'история', 'В каком году произошло крещение Руси?', '988', 10, 6),
(2, 'история', 'Как звали царя, который венчался на царство в 1547 г.?', 'иван', 10, 7),
(3, 'история', 'В каком году было положено начало династии Романовых?', '1613', 10, 8),
(4, 'история', 'Свод  законов России, принятый в 1550 г.', 'судебник', 10, 9),
(5, 'история', 'Как звали императора, при котором состоялось объединение Германской империи?', 'вильгельм', 10, 10);

-- --------------------------------------------------------

--
-- Структура таблицы `results`
--

CREATE TABLE IF NOT EXISTS `results` (
  `user_id` int(11) DEFAULT NULL,
  `game_number` int(10) DEFAULT NULL,
  `theme` varchar(15) DEFAULT NULL,
  `points` int(3) DEFAULT NULL,
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=159 ;

--
-- Дамп данных таблицы `results`
--

INSERT INTO `results` (`user_id`, `game_number`, `theme`, `points`, `id`) VALUES
(1, 1, 'история', 20, 17),
(1, 2, 'литература', 40, 18),
(1, 3, 'литература', 30, 19),
(1, 5, 'литература', 20, 20),
(1, 6, 'литература', 20, 21),
(1, 7, 'история', 20, 22),
(1, 8, 'история', 40, 23),
(1, 9, 'история', 20, 24),
(1, 10, 'история', 10, 25),
(1, 11, 'история', 0, 26);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `name` varchar(15) DEFAULT NULL,
  `surname` varchar(20) DEFAULT NULL,
  `gender` varchar(15) DEFAULT NULL,
  `date_of_birth` varchar(15) DEFAULT NULL,
  `login` varchar(20) DEFAULT NULL,
  `password` varchar(60) DEFAULT NULL,
  `email` varchar(40) DEFAULT NULL,
  `salt` varchar(30) DEFAULT NULL,
  `cookie` varchar(30) DEFAULT NULL,
  `user_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`name`, `surname`, `gender`, `date_of_birth`, `login`, `password`, `email`, `salt`, `cookie`, `user_id`) VALUES
('user1', 'surname1', 'woman', '2000-12-04', 'user1', 'd8009c825838f511eb025f27d14ff85a', 'ret@mail.ru', 'M', NULL, 1),
('user2', 'surname2', 'woman', '''2011-2-24''', 'user2', '77011b986dc85960b77fc6b2bb13d93f', '33@mail.ru', 'K', NULL, 2),
('user2', 'surname2', 'woman', '''2011-2-24''', 'user3', '87a84e9db118b8b05e712292685c80a7', '3333@mail.ru', 'N', NULL, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `usersAnswers`
--

CREATE TABLE IF NOT EXISTS `usersAnswers` (
  `game_number` int(10) DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `question_number_id` int(11) NOT NULL,
  `user_points` int(3) DEFAULT NULL,
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  KEY `question_number_id` (`question_number_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=679 ;

--
-- Дамп данных таблицы `usersAnswers`
--

INSERT INTO `usersAnswers` (`game_number`, `user_id`, `question_number_id`, `user_points`, `id`) VALUES
(1, 1, 1, 0, 284),
(1, 1, 2, 0, 285),
(1, 1, 3, 10, 286),
(1, 1, 4, 10, 287),
(1, 1, 5, 0, 288),
(2, 1, 1, 10, 289),
(2, 1, 2, 10, 290),
(2, 1, 3, 10, 291),
(2, 1, 4, 10, 292),
(2, 1, 5, 0, 293),
(3, 1, 1, 10, 294),
(3, 1, 2, 10, 295),
(3, 1, 3, 0, 296),
(3, 1, 4, 10, 297),
(3, 1, 5, 0, 298),
(4, 1, 1, 10, 299),
(4, 1, 2, 0, 300),
(4, 1, 3, 0, 301),
(4, 1, 4, 0, 302),
(4, 1, 5, 0, 303),
(5, 1, 1, 10, 304),
(5, 1, 2, 10, 305),
(5, 1, 3, 0, 306),
(5, 1, 4, 0, 307),
(5, 1, 5, 0, 308),
(6, 1, 1, 10, 309),
(6, 1, 2, 0, 310),
(6, 1, 3, 10, 311),
(6, 1, 4, 0, 312),
(6, 1, 5, 0, 313),
(7, 1, 1, 0, 314),
(7, 1, 2, 0, 315),
(7, 1, 3, 10, 316),
(7, 1, 4, 10, 317),
(7, 1, 5, 0, 318),
(8, 1, 1, 10, 319),
(8, 1, 2, 10, 320),
(8, 1, 3, 10, 321),
(8, 1, 4, 10, 322),
(8, 1, 5, 0, 323),
(9, 1, 1, 10, 324),
(9, 1, 2, 10, 325),
(9, 1, 3, 0, 326),
(9, 1, 4, 0, 327),
(9, 1, 5, 0, 328),
(10, 1, 1, 10, 329),
(10, 1, 2, 0, 330),
(10, 1, 3, 0, 331),
(10, 1, 4, 0, 332),
(10, 1, 5, 0, 333),
(11, 1, 1, 0, 334),
(11, 1, 2, 0, 335),
(11, 1, 3, 0, 336),
(11, 1, 4, 0, 337),
(11, 1, 5, 0, 338),
(12, 1, 1, 10, 339),
(12, 1, 2, 10, 340),
(12, 1, 3, 0, 341),
(12, 1, 4, 0, 342),
(12, 1, 5, 0, 343),
(13, 1, 1, 10, 344),
(13, 1, 2, 10, 345),
(13, 1, 3, 10, 346),
(13, 1, 4, 0, 347),
(13, 1, 5, 0, 348),
(14, 1, 1, 0, 349),
(14, 1, 2, 10, 350),
(14, 1, 3, 10, 351),
(14, 1, 4, 0, 352),
(14, 1, 5, 0, 353),
(15, 1, 1, 10, 354),
(15, 1, 2, 10, 355),
(15, 1, 3, 0, 356),
(15, 1, 4, 0, 357),
(15, 1, 5, 0, 358),
(16, 1, 1, 10, 359),
(16, 1, 2, 10, 360),
(16, 1, 3, 0, 361),
(16, 1, 4, 10, 362),
(16, 1, 5, 0, 363),
(17, 1, 1, 10, 364),
(17, 1, 2, 10, 365),
(17, 1, 3, 0, 366),
(17, 1, 4, 0, 367),
(17, 1, 5, 0, 368),
(18, 1, 1, 10, 369),
(18, 1, 2, 10, 370),
(18, 1, 3, 10, 371),
(18, 1, 4, 0, 372),
(18, 1, 5, 0, 373),
(19, 1, 1, 10, 374),
(19, 1, 2, 10, 375),
(19, 1, 3, 0, 376),
(19, 1, 4, 0, 377),
(19, 1, 5, 0, 378),
(20, 1, 1, 0, 379),
(20, 1, 2, 0, 380),
(20, 1, 3, 0, 381),
(20, 1, 4, 0, 382),
(20, 1, 5, 0, 383),
(21, 1, 1, 10, 384),
(21, 1, 2, 0, 385),
(21, 1, 3, 0, 386),
(21, 1, 4, 0, 387),
(21, 1, 5, 0, 388),
(22, 1, 1, 10, 389),
(22, 1, 2, 0, 390),
(22, 1, 3, 0, 391),
(22, 1, 4, 0, 392),
(22, 1, 5, 0, 393),
(23, 1, 1, 10, 394),
(23, 1, 2, 10, 395),
(23, 1, 3, 0, 396),
(23, 1, 4, 0, 397),
(23, 1, 5, 0, 398),
(24, 1, 1, 10, 399),
(24, 1, 2, 0, 400),
(24, 1, 3, 0, 401),
(24, 1, 4, 0, 402),
(24, 1, 5, 0, 403),
(25, 1, 1, 0, 404),
(25, 1, 2, 0, 405),
(25, 1, 3, 0, 406),
(25, 1, 4, 0, 407),
(25, 1, 5, 0, 408),
(26, 1, 1, 10, 409),
(26, 1, 2, 0, 410),
(26, 1, 3, 0, 411),
(26, 1, 4, 0, 412),
(26, 1, 5, 0, 413),
(27, 1, 1, 10, 414),
(27, 1, 2, 0, 415),
(27, 1, 3, 0, 416),
(27, 1, 4, 0, 417),
(27, 1, 5, 0, 418),
(28, 1, 1, 10, 419),
(28, 1, 2, 10, 420),
(28, 1, 3, 0, 421),
(28, 1, 4, 0, 422),
(28, 1, 5, 0, 423),
(29, 1, 1, 10, 424),
(29, 1, 2, 10, 425),
(29, 1, 3, 10, 426),
(29, 1, 4, 0, 427),
(29, 1, 5, 0, 428),
(30, 1, 1, 10, 429),
(30, 1, 2, 0, 430),
(30, 1, 3, 0, 431),
(30, 1, 4, 0, 432),
(30, 1, 5, 0, 433),
(31, 1, 1, 10, 434),
(31, 1, 2, 0, 435),
(31, 1, 3, 0, 436),
(31, 1, 4, 0, 437),
(31, 1, 5, 0, 438),
(32, 1, 1, 10, 439),
(32, 1, 2, 0, 440),
(32, 1, 3, 0, 441),
(32, 1, 4, 0, 442),
(32, 1, 5, 0, 443),
(33, 1, 1, 10, 444),
(33, 1, 2, 0, 445),
(33, 1, 3, 0, 446),
(33, 1, 4, 0, 447),
(33, 1, 5, 0, 448),
(34, 1, 1, 10, 449),
(34, 1, 2, 0, 450),
(34, 1, 3, 0, 451),
(34, 1, 4, 0, 452),
(34, 1, 5, 0, 453),
(35, 1, 1, 10, 454),
(35, 1, 2, 0, 455),
(35, 1, 3, 0, 456),
(35, 1, 4, 0, 457),
(35, 1, 5, 0, 458),
(36, 1, 1, 10, 459),
(36, 1, 2, 0, 460),
(36, 1, 3, 0, 461),
(36, 1, 4, 0, 462),
(36, 1, 5, 0, 463),
(37, 1, 1, 0, 464),
(37, 1, 2, 0, 465),
(37, 1, 3, 0, 466),
(37, 1, 4, 0, 467),
(37, 1, 5, 0, 468),
(38, 1, 1, 10, 469),
(38, 1, 2, 0, 470),
(38, 1, 3, 0, 471),
(38, 1, 4, 0, 472),
(38, 1, 5, 0, 473),
(39, 1, 1, 10, 474),
(39, 1, 2, 0, 475),
(39, 1, 3, 0, 476),
(39, 1, 4, 0, 477),
(39, 1, 5, 0, 478),
(40, 1, 1, 0, 479),
(40, 1, 2, 0, 480),
(40, 1, 3, 10, 481),
(40, 1, 4, 0, 482),
(40, 1, 5, 0, 483),
(41, 1, 1, 0, 484),
(41, 1, 2, 10, 485),
(41, 1, 3, 0, 486),
(41, 1, 4, 0, 487),
(41, 1, 5, 0, 488),
(42, 1, 1, 10, 489),
(42, 1, 2, 0, 490),
(42, 1, 3, 0, 491),
(42, 1, 4, 0, 492),
(42, 1, 5, 0, 493),
(43, 1, 1, 10, 554),
(43, 1, 2, 10, 555),
(43, 1, 3, 10, 556),
(43, 1, 4, 0, 557),
(43, 1, 5, 0, 558),
(44, 1, 1, 10, 559),
(44, 1, 2, 10, 560),
(44, 1, 3, 10, 561),
(44, 1, 4, 0, 562),
(44, 1, 5, 0, 563),
(45, 1, 1, 10, 564),
(45, 1, 2, 0, 565),
(45, 1, 3, 10, 566),
(45, 1, 4, 0, 567),
(45, 1, 5, 0, 568),
(46, 1, 1, 10, 569),
(46, 1, 2, 10, 570),
(46, 1, 3, 10, 571),
(46, 1, 4, 0, 572),
(46, 1, 5, 0, 573),
(47, 1, 1, 0, 574),
(47, 1, 2, 0, 575),
(47, 1, 3, 0, 576),
(47, 1, 4, 0, 577),
(47, 1, 5, 0, 578),
(1, 2, 1, 10, 609),
(1, 2, 2, 0, 610),
(1, 2, 3, 10, 611),
(1, 2, 4, 0, 612),
(1, 2, 5, 0, 613),
(2, 2, 1, 0, 614),
(2, 2, 2, 10, 615),
(2, 2, 3, 10, 616),
(2, 2, 4, 0, 617),
(2, 2, 5, 0, 618),
(48, 1, 1, 10, 619),
(48, 1, 2, 0, 620),
(48, 1, 3, 10, 621),
(48, 1, 4, 0, 622),
(48, 1, 5, 0, 623),
(49, 1, 1, 0, 624),
(49, 1, 2, 10, 625),
(49, 1, 3, 10, 626),
(49, 1, 4, 0, 627),
(49, 1, 5, 0, 628),
(3, 2, 1, 0, 629),
(3, 2, 2, 10, 630),
(3, 2, 3, 10, 631),
(3, 2, 4, 0, 632),
(3, 2, 5, 0, 633),
(4, 2, 1, 0, 634),
(4, 2, 2, 10, 635),
(4, 2, 3, 10, 636),
(4, 2, 4, 0, 637),
(4, 2, 5, 0, 638),
(5, 2, 1, 10, 639),
(5, 2, 2, 0, 640),
(5, 2, 3, 10, 641),
(5, 2, 4, 0, 642),
(5, 2, 5, 0, 643),
(6, 2, 1, 10, 644),
(6, 2, 2, 0, 645),
(6, 2, 3, 0, 646),
(6, 2, 4, 0, 647),
(6, 2, 5, 0, 648),
(7, 2, 1, 0, 649),
(7, 2, 2, 10, 650),
(7, 2, 3, 0, 651),
(7, 2, 4, 0, 652),
(7, 2, 5, 0, 653),
(8, 2, 1, 10, 654),
(8, 2, 2, 0, 655),
(8, 2, 3, 0, 656),
(8, 2, 4, 0, 657),
(8, 2, 5, 0, 658),
(9, 2, 1, 10, 659),
(9, 2, 2, 0, 660),
(9, 2, 3, 0, 661),
(9, 2, 4, 0, 662),
(9, 2, 5, 0, 663),
(10, 2, 1, 10, 664),
(10, 2, 2, 10, 665),
(10, 2, 3, 10, 666),
(10, 2, 4, 0, 667),
(10, 2, 5, 0, 668),
(11, 2, 1, 0, 669),
(11, 2, 2, 0, 670),
(11, 2, 3, 0, 671),
(11, 2, 4, 0, 672),
(11, 2, 5, 0, 673);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
